In [2]:
import pandas as pd

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052])

In [4]:
print(s)
print(type(s))

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
print(s.values)
print(type(s.values))

[9904312 3448737 2890451 2466052]
<class 'numpy.ndarray'>

In [6]:
print(s)

0    9904312
1    3448737
2    2890451
3    2466052
dtype: int64

In [7]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index = ["서울", "부산", "인천", "대구"])
print(s)

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [9]:
myPDS = pd.Series(range(10, 14))

In [10]:
myPDS

0    10
1    11
2    12
3    13
dtype: int64

In [11]:
print(type(myPDS))

<class 'pandas.core.series.Series'>

In [12]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [13]:
print(s.name)
print(s.index.name)

None
None

In [14]:
s.name = "인구 분석"
s.index.name = "도시"
print(s)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [15]:
print(s.name)
print(s.index.name)

인구 분석
도시

# 시리즈 연산<br>
넘파이 배열처럼 시리즈도 벡터화 연산을 할 수 있음<br>
다만, 연산은 시리즈의 값에만 적용되며 인덱스 값은 변하지 않음

In [16]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [17]:
type(s)

pandas.core.series.Series

In [18]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구 분석, dtype: float64

In [19]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [20]:
print(s.iloc[1], s["부산"])

3448737 3448737

In [21]:
print(s[3], s["대구"])

2466052 2466052

In [22]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구 분석, dtype: int64

In [23]:
s0 = pd.Series(range(3), index = ["a", "b", "c"])
print(s0)

a    0
b    1
c    2
dtype: int64

In [25]:
s0["a"], s0.iloc[0]

(0, 0)

In [26]:
s0.a

0

# 시리즈와 딕셔너리 자료형<br>

시리즈 객체는 라벨 값에 의해 인덱싱이 가능하므로 실질적으로 인덱스 라벨 값을 키(key)로 가지는 딕셔너리

In [27]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [28]:
"서울" in s

True

In [29]:
"대전" in s

False

In [30]:
for data in s.items():
    print(data)

('서울', 9904312)
('부산', 3448737)
('인천', 2890451)
('대구', 2466052)

In [31]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

딕셔너리 객체에서 시리즈를 만들 수도 있음

In [32]:
import pandas as pd
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, "대전" : 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

딕셔너리의 원소는 순서를 가지지 않으므로 시리즈이 데이터도 순서가 보장되지 않음<br>
만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해야 함

In [33]:
s2 = pd.Series({"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, "대전" : 1490158},
               index = ["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [34]:
type(s2)

pandas.core.series.Series

# 인덱스 기반 연산

In [35]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [36]:
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [37]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [38]:
type(s.values)

numpy.ndarray

In [39]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [40]:
type(s2.values)

numpy.ndarray

In [41]:
ds = s - s2

In [43]:
print(type(ds))

<class 'pandas.core.series.Series'>

In [44]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [45]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

인구 증가율(%) 구하기

In [46]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구 분석, dtype: int64

In [47]:
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [48]:
rs = (s - s2) / s2 * 100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [49]:
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

# 데이터의 갱신, 추가, 삭제<br>
인덱싱을 이용하면 딕셔너리처럼 데이터를 update 하거나 add 할 수 있음

In [50]:
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [51]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [52]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [53]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

# 판다스 데이터 프레임 (DataFrame) 클래스<br>
데이터 프레임은 행과 열로 이루어진 2차원 데이터 구조로, 여러 종류의 데이터를 공통의 인덱스를 기준으로 정렬하여 저장함

### 데이터 프레임의 정의<br>
데이터 프레임은 엑셀 스프레드시트나 SQL 테이블과 유사한 형태를 띠며, 각 열은 서로 다른 데이터 타입을 가질 수 있음

### 데이터 프레임의 특징<br>
다양한 데이터 타입 지원 : 하나의 데이터프레임 내에서도 서로 다른 데이터 타입의 열을 포함할 수 있음<br><br>
크기 변경 가능 : 데이터프레임의 크기는 데이터를 추가하거나 삭제함으로써 동적으로 변경될 수 있음<br><br>
라벨링된 축 : 데이터프레임은 행과 열 모두에 라벨(인덱스)을 가지며, 이를 통해 데이터에 접근하고 조작할 수 있음<br><br>
데이터 조작 및 변환 : 다양한 데이터 조작 기능을 제공하여 데이터 분석을 용이하게 함<br><br>
결측치 처리 : 판다스는 데이터프레임 내에서 결측치를 감지하고, 처리하기 위한 효율적인 방법을 제공함<br><br>
데이터 정렬 및 재구성 : 데이터프레임을 통해 데이터를 쉽게 정렬하고, pivot 또는 melt 같은 방법을 이용해 데이터 구조를 재구성할 수 있음<br><br>
강력한 데이터 분석 및 가공 도구 : 데이터프레임은 데이터 가공, 분석, 시각화를 위한 다양한 메소드를 정의함

In [54]:
data = [['John', 28, 'Male'],
        ['Kate', 23, 'Female'],
        ['David', 31, 'Male'],
        ['Emily', 27, 'Female']]
columns = ['Name', 'Age', 'Gender']
df = pd.DataFrame(data, columns=columns)
print(df)

    Name  Age  Gender
0   John   28    Male
1   Kate   23  Female
2  David   31    Male
3  Emily   27  Female

In [55]:
print(df.values)
print(df.columns)
print(df.index)

[['John' 28 'Male']
 ['Kate' 23 'Female']
 ['David' 31 'Male']
 ['Emily' 27 'Female']]
Index(['Name', 'Age', 'Gender'], dtype='object')
RangeIndex(start=0, stop=4, step=1)

In [56]:
print(type(df.values))
print(type(df.columns))
print(type(df.index))

<class 'numpy.ndarray'>
<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.range.RangeIndex'>

데이터프레임의 열 인덱스가 문자열 라벨을 가지고 있는 경우에는 순서를 나타내는 정수 인덱스를 열 인덱싱에 사용할 수 없음<br>
-> 정수 인덱싱의 슬라이스는 행을 인덱싱할 때 사용기 때문<br><br>
정수 인덱스를 넣으면 KeyError 오류가 발생함

In [58]:
print(df["Name"])

0     John
1     Kate
2    David
3    Emily
Name: Name, dtype: object

In [59]:
print(df["Name"][0])

John

# 딕셔너리 기반 데이터프레임을 만드는 방법<br>
1. 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비함
2. 이 각각의 열에 대한 이름(라벨)을 키로 가지는 딕셔너리를 만듦
3. 이 데이터를 DataFrame 클래스 생성자에 넣음 / 동시에 열방향 인덱스는 columns 인수로, 행방향 인덱스는 index 인수로 지정함

In [60]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]

df = pd.DataFrame(data, index = index, columns = columns)
print(df)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

앞에서 데이터프레임은 2차원 배열 데이터를 기반으로 한다고 했지만, 사실은 공통 인덱스를 가지는 열 시리즈 (column series)를 딕셔너리로 묶어놓은 것이라고 보는 것이 더 정확함<br>
-> 2차원 배열 데이터는 모든 원소가 같은 자료형을 가져야 하지만, 데이터프레임은 각 열마다 자료형이 다를 수 있기 때문임

In [61]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [62]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [63]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [64]:
import pandas as pd

grade = {
    "국어": [100, 80, 70, 90, 90],
    "수학": [70, 60, 100, 80, 90],
    "영어": [80, 50, 90, 80, 90],
    "사회": [90, 90, 70, 60, 80],
    "과학": [100, 80, 70, 80, 90],
}

name = ["짱구", "철수", "훈이", "유리", "맹구"]
index = ["국어", "수학", "영어", "사회", "과학"]

df1 = pd.DataFrame(grade, columns = index, index = name)
df1

     국어   수학  영어  사회   과학
짱구  100   70  80  90  100
철수   80   60  50  90   80
훈이   70  100  90  70   70
유리   90   80  80  60   80
맹구   90   90  90  80   90

In [67]:
import pandas as pd

data = {
    "이름": ["홍길동", "전우치", "심청이", "철수", "영희"],
    "국어": [95, 90, 85, 93, 87],
    "영어": [90, 87, 93, 94, 89],
    "수학": [73, 95, 87, 89, 93],
}

columns = ["이름", "국어", "영어", "수학"]
index = ["1번", "2번", "3번", "4번", "5번"]

df_ex = pd.DataFrame(data, index = index, columns = columns)
print(df_ex)

df_ex['평균'] = ((df_ex['국어'] + df_ex['영어'] + df_ex['수학']) / 3).round(2)
df_ex

     이름  국어  영어  수학
1번  홍길동  95  90  73
2번  전우치  90  87  95
3번  심청이  85  93  87
4번   철수  93  94  89
5번   영희  87  89  93

     이름  국어  영어  수학     평균
1번  홍길동  95  90  73  86.00
2번  전우치  90  87  95  90.67
3번  심청이  85  93  87  88.33
4번   철수  93  94  89  92.00
5번   영희  87  89  93  89.67

In [68]:
df[:1]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [69]:
df[1:2]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [70]:
df[1:3]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [71]:
df["서울":"부산"]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163